module.exports = {
    greeting: ' 👋! Я чат-бот приложения H2K 🤖. Постараюсь решить ваши вопросы 🤓 ',
    warning: 'Прошу отправлять вопрос единым сообщением и формулировать наиболее емко. (Подождите 5 секунд прежде, чем отправлить следующее сообщение, иначе оно не будет учитываться)',
    clearHistory: 'История запросов была очищена.',
    linkReceived: 'Я не могу обрабатывать ссылки.',
    noRequests: 'Вы еще не делали запросы.',
    spamMessage: 'Это сообщение не содержит в себе достаточно информации.',
    timeSpam: 'От предыдущего вопроса не прошло и 5 секунд.',
    tokenLimit: 'Вы достигли лимита. Запустите команду /clear.',
    manyRequests: 'ChatGPT не может обработать ваш вопрос из-за большой нагрузки, попробуйте позже.',
    newMessage: 'Запрос обрабатывается...'
};